Revit 2027 API
PanelScheduleData Methods
The PanelScheduleData type exposes the following members.
Methods
Name | Description
AddLoadClassification |  Add a Load Classification Id to the array of Load Classifications.
Dispose
(Inherited from TableData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLoadClassifications |  Gets an array of the load classifications associated with this panel schedule
GetNumberOfCircuitRows |  Gets the number of rows in the circuit table
GetSectionData(Int32) |  Returns the section data array element at the specified index.
(Inherited from TableData)
GetSectionData(SectionType) |  Returns the pointer to the section data array element at the specified section type.
(Inherited from TableData)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Checks if this element is equal in value to the other element.
(Inherited from TableData)
IsSymmetric |  Check if this panel schedule is symmetric
IsValidZoomLevel |  Verifies if the value of zoom level is valid.
(Inherited from TableData)
RemoveLoadClassification |  Remove a Load Classification Id from the array of Load Classifications
SetBorderAroundSchedule |  Adds a border around the schedule
SetBorderAroundSections |  Adds a border around the sections
SetLoadClassifications |  Sets the Load Classifications associated with this panel schedule
ToString | Returns a string that represents the current object.
(Inherited from Object)
UpdateCircuitTableForInstance |  Redraw the circuit table for the given panel with the given parameter updates
UpdateCircuitTableForTemplate |  Redraw the circuit table for a template with the given parameter updates
UpdateIsSectionHidden |  Update if this section is hidden or not
UpdateLoadSummary |  Update the load summary section
UpdateVerticalHeadersInSection |  Sets if this header should have vertical text
Top
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace